Case_2/CFD/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1300
(
100
100
100
100
100
100
100
100
...
)
;

boundaryField
{
    wall_bottom
    {
        type            fixedValue;
        value           uniform 100;
    }
    wall_top
    {
        type            zeroGradient;
    }
    front1
    {
        type            cyclic;
    }
    back1
    {
        type            cyclic;
    }
    left1
    {
        type            cyclic;
    }
    right1
    {
        type            cyclic;
    }
    front2
    {
        type            cyclic;
    }
    back2
    {
        type            cyclic;
    }
    left2
    {
        type            cyclic;
    }
    right2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
